#Найти остаток от деления a на b.
a=int(input())
b=int(input())
print(a%b)